# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа.
# n — кол-во элементов первого множества. m — кол-во элементов второго множества.
# Затем пользователь вводит сами элементы множеств.


# n = int(input("Введите кол-во элементов первого множества: "))
# m = int(input("Введите кол-во элементов второго множества: "))
# set_1 = set()
# set_2 = set()
# a = set([int(x) for x in input("Введите элементы первого множества: ").split()])
# for i in a:
#     set_1.add(i)
# b = set([int(x) for x in input("Введите элементы второго множества: ").split()])
# for i in b:
#     set_2.add(i)
# kool = list(set_1 & set_2)
# kool.sort()
# for i in kool:
#     print(i, end=" ")


# Задача 24: У каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, на i-ом кусте выросло ai ягод.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом,
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход модуль,
# находясь перед некоторым кустом заданной во входном файле грядки.

# n = int(input("Введите кол-во кустов: "))
# array = list()
# for i in range(n):
#     x = int(input(f"Введите кол-во ягод на {i+1} кусте: "))
#     array.append(x)

# array_count = list()
# for i in range(len(array) - 1):
#     array_count.append(array[i - 1] + array[i] + array[i + 1])
# array_count.append(array[-2] + array[-1] + array[0])
# print(max(array_count))
