# Задача 2: Найдите сумму цифр трехзначного числа.

# n = int(input("Введите трёхзначное число: "))
# if n < 100 or n > 1000:
#     print("Вы ввели некорректное число")
# else:
#     sum = n % 10 + (n // 10 % 10) + (n // 100 % 10)
#     print("Сумма цифр =", sum)


# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# n = int(input("Введите количество журавликов: "))
# m = n // 6
# print("Петя -", m, "; Катя -", m * 4, "; Серёжа -", m)


# Задача 6: Счастливым билетом называют такой билет с шестизначным номером,
# где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.
# Вам требуется написать программу, которая проверяет счастливость билета.

# n = int(input("Введите номер билета: "))
# if n < 100000 or n > 1000000:
#     print("Вы ввели некорректный номер")
# else:
#     n2 = n // 1000
#     left = n2 % 10 + (n2 // 10 % 10) + (n2 // 100 % 10)
#     right = n % 10 + (n // 10 % 10) + (n // 100 % 10)
# if left == right:
#     print("Билет счастливый")
# else:
#     print("Билет не счастливый")


# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек,
# если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

# n = int(input("Введите длину: "))
# m = int(input("Введите ширину: "))
# k = int(input("Введите количество долек: "))

# if k < m * n and (k % m == 0 or k % n == 0):
#     print("Yes")
# else:
#     print("No")
