# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть,
# чтобы все монетки были повернуты вверх одной и той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть

# n = int(input("Введите количество монеток: "))
# count_zero = 0
# count_one = 0
# for i in range(n):
#     x = int(input("Введите 0 или 1 для определения монетки "))
#     if x == 0:
#         count_zero += 1
#     else:
#         count_one += 1
# if count_one > count_zero:
#     print("решка", count_zero)
# else:
#     print("орёл", count_one)


# Задача 12: Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000),
# а Катя должна их отгадать. Для этого Петя делает две подсказки.
# Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

# x = int(input("Введите сумму двух чисел: "))
# y = int(input("Введите произведение чисел: "))
# for i in range(x):
#     for j in range(y):
#         if x == i + j and y == i * j:
#             print(i, j)


# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

# n = int(input("Введите последнее число N: "))
# i = 0
# while 2**i <= n:
#     print(f" 2 в степени {i} равна {2 ** i}")
#     i += 1
